#+TITLE: Practice - Trendline with =Nile= data
#+AUTHOR: Marcus Birkenkrahe
#+startup: overview hideblocks indent entitiespretty:
#+options: toc:nil num:nil title:nil subtitle:nil
** Loading the dataset with =data=

- The =mtcars= dataset is built into "base R" which comes from CRAN at
  =cran.r-project.org=, the Comprehensive R Archive Network. To load it
  you can use the =data= function:
  #+begin_src R :session *R* :results none
    data(mtcars)
  #+end_src

- Can you explain the code block header arguments?
  #+begin_quote
  1. =:session *R*= means that the code will be executed in an R console
     buffer named =*R*=. If it does not exist, it will be created.
  2. =:results none= means that no results will be printed to =stdout= (in
     this case: the screen) because =data= does not generate output.
  #+end_quote

- =data= produces no output but it loads =Nile= into R's current
  environment - how can we check what's in the environment?
  #+begin_src R :session *R* :results output :exports both
    ls() # Output: "Nile"
  #+end_src

  #+RESULTS:
  : [1] "mtcars" "Nile"   "trend"

